// qna.js

export const qnaUserConfigData = [
    {
        "q" : "Q. 제 프로필 설정을 변경하고 싶어요.",
        "a" : "A. 좌측 하단의 프로필 아이콘을 클릭합니다. 프로필 편집으로 이동해 우측에 있는 수정버튼을 클릭합니다. 수정하고 싶은 정보를 수정한 뒤 변경사항 저장하기를 클릭합니다."
    },
    {
        "q" : "Q. 계정을 삭제를 하고 싶어요",
        "a" : "A. 좌측 하단의 프로필 아이콘을 클릭합니다. 프로필 편집으로 이동해 삭제를 원할시 삭제버튼을 클릭합니다."
    },
    {
        "q" : "Q. 로그아웃은 어디서 하나요?",
        "a" : "A. 좌측 하단의 프로필 아이콘을 클릭합니다. 로그아웃 버튼을 클릭합니다."
    },
    {
        "q" : "Q. 아바타 장식이란 무엇인가요?",
        "a" : "A. 아바타 장식을 통해 Dixcord에서 아바타를 꾸미고 스타일을 정할 수 있습니다."
    },
    {
        "q" : "Q. 사용자 지정 프로필",
        "a" : "A. 사용자의 필요에 맞게 프로필을 사용자 지정할 수 있는 방법은 여러 가지가 있습니다. 새로운 아바타에서 새로운 배너, 그리고 그 사이의 모든 것들까지 가능하게 됩니다."
    },
    {
        "q" : "Q. QR 코드 로그인",
        "a" : "A. QR 코드 로그인을 사용하면 전체 비밀번호를 입력하거나 익숙하지 않은 설정에서 비밀번호를 공유하지 않고도 빠르고 안전하게 Dixcord에 연결할 수 있습니다."
    }
];

export const qnaServerConfigData = [
    {
        "q" : "Q. 서버는 어떻게 만드나요?",
        "a" : "A. 앱 왼쪽의 서버 목록를 아래로 스크롤하여 서버 추가하기 () 아이콘이 숨어 있는 위치를 찾으면 됩니다."
    },
    {
        "q" : "Q. 서버 채팅채널에서 이미지도 전송 가능하나요?",
        "a" : "A. 물론입니다! 이미지는 물론 GIF, 이모지 등도 전송할 수 있습니다."
    },
    {
        "q" : "Q. 개인 서버를 설정하려면 어떻게 해야 하나요?",
        "a" : "A. “개인” 서버를 설정하면 서버 및 채널에 대한 접근 권한이 지정된 멤버만 접근할 수 있도록 제한됩니다."
    },
    {
        "q" : "Q. 아바타 장식이란 무엇인가요?",
        "a" : "A. 아바타 장식을 통해 Dixcord에서 아바타를 꾸미고 스타일을 정할 수 있습니다."
    },
    {
        "q" : "Q. 친구를 서버에 초대하는 방법",
        "a" : "A. 서버를 열고 채널 이름 옆에 있는 초대 코드를 생성 혹은 프로필을 마우스 우클릭해 초대합니다."
    }
];

export const qnaChatConfigData = [
    {
        "q" : "Q. 친구 추가는 어떻게 하나요?",
        "a" : "A. 왼쪽 사이드바의 친구 항목에서 + 버튼을 누르면 추가할 수 있습니다."
    },
    {
        "q" : "Q. 이모지 추가하기",
        "a" : "A. 메시지에 이모지를 추가하는 것은 아주 간단합니다! 텍스트 막대 오른쪽의 회색으로 표시된 이모지 선택기 버튼 위로 마우스를 가져 가세요."
    },
    {
        "q" : "Q. DM이 전송되지 않는 이유는 무엇인가요?",
        "a" : "A. 메시지가 전송되지 않았어요. 이는 일반적으로 회원님이 받는 사람과 서버를 공유하지 않거나, 받는 사람이 친구의 다이렉트 메시지만 받도록 설정했기 때문입니다."
    },
    {
        "q" : "Q. 메시지 수정하기",
        "a" : "A. 메시지 위에 마우스를 올리고 수정을 위해 펜 아이콘을 선택합니다. 오타를 수정합니다."
    },
    {
        "q" : "Q. 파일 첨부란 무엇인가요?",
        "a" : "A. 사용자는 문자 메시지 외에도 Discord에서 첨부 파일을 업로드하여 다른 사람에게 보낼 수 있습니다."
    }
];

export const qnaSecurityConfigData = [
    {
        "q" : "Q. Discord 계정이 해킹당했거나 유출되었습니다",
        "a" : "A. 당사의 이용 약관에 따라 회원님의 계정 보안에 대한 책임은 회원님에게 있습니다. 계정 보안에 실패하여 계정이 유출된 경우, Discord에서 계정 복구를 지원하지 못할 수 있다는 점에 유의하세요."
    },
    {
        "q" : "Q. 경고 시스템",
        "a" : "A. 경고 시스템은 사용자가 저희 운영원칙을 위반한 경우, 저희가 취한 조치, 전체 계정 상태에 어떤 영향을 미칠 수 있는지 알려줍니다."
    },
    {
        "q" : "Q. 휴면 계정 삭제",
        "a" : "A. “Dixcord에서 2년 이상 사용하지 않았던 계정은 자동으로 삭제될 예정입니다."
    },
    {
        "q" : "Q. 법 집행 기관을 위한 사용자 ID 찾기",
        "a" : "A. 당사는 사용자 식별 번호, 사용자명, 이메일을 통해 시스템에서 사용자를 찾을 수 있습니다. 사용자 식별 번호가 가장 선호됩니다. "
    },
    {
        "q" : "Q. 사망 또는 무력화된 사용자",
        "a" : "A. 사망한 사용자의 Dixcord 계정에 액세스할 수 있는 경우 아래 단계에 따라 계정 삭제 절차를 시작할 수 있습니다."
    }
];